app/Models/M_home.php

    public function tot_mutasi()
    {
        return $this->db->table('tbl_mutation')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_mutation`

    public function tot_produk()
    {
        return $this->db->table('tbl_data_produk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_data_produk`

    public function tot_pengguna()
    {
        return $this->db->table('tbl_data_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_data_user`

    public function tot_cabang()
    {
        return $this->db->table('tbl_data_cabang')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_data_cabang`