app/Models/M_jenis.php

SELECT *
FROM `tbl_jenis_produk`
---
    public function all_jenis()
    {
        return $this->db->table('tbl_jenis_produk')
        ->get()->getResultArray();