app/Models/M_laporan_admin.php

SELECT *
FROM `tbl_laporan_produk`
LEFT JOIN `tbl_mutation` ON `tbl_mutation`.`id_mutation`=`tbl_laporan_produk`.`id_mutation`
LEFT JOIN `tbl_data_produk` ON `tbl_data_produk`.`id_produk`=`tbl_laporan_produk`.`id_produk`
LEFT JOIN `tbl_data_cabang` ON `tbl_data_cabang`.`id_cabang`=`tbl_laporan_produk`.`id_cabang`
---
    public function get_laporan_admin()
    {
        return $this->db->table('tbl_laporan_produk')
            ->join('tbl_mutation', 'tbl_mutation.id_mutation=tbl_laporan_produk.id_mutation', 'left')
            ->join('tbl_data_produk', 'tbl_data_produk.id_produk=tbl_laporan_produk.id_produk', 'left')
            ->join('tbl_data_cabang', 'tbl_data_cabang.id_cabang=tbl_laporan_produk.id_cabang', 'left')
            ->get()->getResultArray();