app/Models/M_motif.php

SELECT *
FROM `tbl_motif_produk`
---
    public function all_motif()
    {
        return $this->db->table('tbl_motif_produk')
        ->get()->getResultArray();