app/Models/M_produk.php

    public function get_produk()
    {
        return $this->db->table('tbl_data_produk')
            ->join('tbl_motif_produk', 'tbl_motif_produk.id_motif=tbl_data_produk.id_motif', 'left')
            ->join('tbl_jenis_produk', 'tbl_jenis_produk.id_jenis=tbl_data_produk.id_jenis', 'left')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_data_produk`
LEFT JOIN `tbl_motif_produk` ON `tbl_motif_produk`.`id_motif`=`tbl_data_produk`.`id_motif`
LEFT JOIN `tbl_jenis_produk` ON `tbl_jenis_produk`.`id_jenis`=`tbl_data_produk`.`id_jenis`