app/Models/M_stok.php

    public function get_stok()
    {
        return $this->db->table('tbl_stok_produk')
            ->join('tbl_motif_produk', 'tbl_motif_produk.id_motif=tbl_stok_produk.id_motif', 'left')
            ->join('tbl_data_produk', 'tbl_data_produk.id_produk=tbl_stok_produk.id_produk', 'left')
            ->join('tbl_data_cabang', 'tbl_data_cabang.id_cabang=tbl_stok_produk.id_cabang', 'left')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_stok_produk`
LEFT JOIN `tbl_motif_produk` ON `tbl_motif_produk`.`id_motif`=`tbl_stok_produk`.`id_motif`
LEFT JOIN `tbl_data_produk` ON `tbl_data_produk`.`id_produk`=`tbl_stok_produk`.`id_produk`
LEFT JOIN `tbl_data_cabang` ON `tbl_data_cabang`.`id_cabang`=`tbl_stok_produk`.`id_cabang`

    public function get_stok2()
    {
        return $this->db->table('tbl_mutation')
            ->join('tbl_data_produk', 'tbl_data_produk.id_produk=tbl_mutation.id_produk', 'left')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_mutation`
LEFT JOIN `tbl_data_produk` ON `tbl_data_produk`.`id_produk`=`tbl_mutation`.`id_produk`