app/Models/M_user.php

    public function get_user()
    {
        return $this->db->table('tbl_data_user')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_data_user`